Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.SaveActiveDrawing Method
 Saves the currently open drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SaveActiveDrawing()
Public Function SaveActiveDrawing As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace